sdaiDeleteSchemaInstanceBN(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,Sdai_instS*)
\details
Deletes a specified schema instance.
\param schemaInstanceName [in] A string that contains the schema instance name.
\param repository         [in] A repository where the function searches the schema instance by the specified name.